[
    {
     "id": 1,
      "img": "images/services/seo-icons/image5.svg",
      "head": "Discover",
      "alt": "Discover Icon",
      "text": "We collaborate with your team to understand your business goals, conduct an initial site review, and identify KPIs. Through keyword research and conversion path analysis, we gain deep insights into your processes and objectives."
    },
    {
      "id": 2,
      "img": "images/services/seo-icons/image7.svg",
      "head": "Analyse",
      "alt": "Analyse Icon",
      "text": "We analyze business data through competitive benchmarking, site audits, and traffic patterns to assess your digital presence. This helps us identify key factors and craft the best SEO strategy based on analytics and competitor insights."
    },
    {
      "id": 3,
      "img": "images/services/seo-icons/image8.svg",
      "head": "Strategize",
      "alt": "Strategize Icon",
      "text": "We create a 60-day SEO plan outlining goals, outcomes, and timelines, prioritizing critical aspects for quick, targeted results. Our focus in the first month is to ensure immediate impact across key marketing channels."
    },
    {
      "id": 4,
      "img": "images/services/seo-icons/image9.svg",
      "head": "Execute",
      "alt": "Execute Icon",
      "text": "We execute the SOMP by optimizing web pages, improving site structure, and managing business listings. We also boost SEO with multi-channel strategies, including social media campaigns and outreach to third-party websites."
    },
    {
      "id": 5,
      "img": "images/services/seo-icons/image6.svg",
      "head": "Measure",
      "alt": "Measure Icon",
      "text": "We set up tracking to monitor your SEO progress, analyzing analytics, keyword rankings, and KPIs. This helps us gain insights into traffic, bounce rates, conversions, and CTRs to refine and improve your SEO strategies."
    },
    {
      "id": 6,
      "img": "images/services/seo-icons/image10.svg",
      "head": "Report",
      "alt": "Report Icon",
      "text": "Our SEO team provides regular consultations and monthly reports, detailing site performance, KPI trends, and rankings. Each month, we create a new 90-day roadmap to keep you informed on campaign progress and expectations."
    },
    {
      "id": 7,
      "img": "images/services/seo-icons/image4.svg",
      "head": "Adjust",
      "alt": "Adjust Icon",
      "text": "We continuously adjust SEO strategies to keep up with algorithm updates and market trends, ensuring high search rankings. Our proactive approach keeps your website optimized and you informed on campaign progress."
    }
  ]